# GetExtraOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCImportOptions..::..GetExtraOptions Method
IFCImportOptions Class See Also
---
Get the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public IDictionary<string, string> GetExtraOptions()
```

Visual Basic
---
```text
Public Function GetExtraOptions As IDictionary(Of String, String)
```

Visual C++
---
```text
public:
IDictionary<String^, String^>^ GetExtraOptions()
```

# ### Return Value
The list of options.
# See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace